mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
/*
 * app_main.cpp
 *
 *  Created on: May 14, 2026
 *      Author: karadeli
 */

#include "globals.hpp"
#define DISABLE_CRC true
#define CHECK_TIMER_FREQUENCIES false


#include <shared_memory.h>
#include "app_main.hpp"
#include "main.h"
#include "i2c.h"
#include "spi.h"
#include "ring_buffer.h"
#include <string.h>
#include "task_timer.h"
#include "PressureSensor.hpp"
#include "globals.hpp"
#include "Button.hpp"
#include "string.h"
#include "UserTask.hpp"
#include "MissionUart.hpp"

#include "MissionControl.hpp"
//#include "platformController.h"

#include "BNO085.hpp"
#include "SdCard/sd_task.hpp"
//#include "SdCardRaw.hpp"
#include "nrf24.h"
#include "nrf24_port.h"
BNO085 imu;


#define FRACTIONAL(x) int(floor(int((x)*100)))%100
#define LOG_TERMINATOR  0x0A0Du   /* LF,CR packed MSB-first */

//#define PI 3.1415926536f

// TODO: PS sensor 3 encodere yakin olan
// TODO: PS sensor 0 alttaki
void LED_Counter_Tick(void);


// TODO: islemci acilma sirasinda akim sensorlerini sifirlayacak.


volatile uint64_t micros_overflow=0;
float load;
//uint32_t local_sensor_data_dropped=0;



void current_adc_complete();
void encoder_adc_complete();
void pressure_adc_complete();

task_timer_t test_point_gpio = {5000,0};
task_timer_t button_task = {1,0};
task_timer_t IMU_task = {1,0};
task_timer_t sd_card_task = {500,0};
task_timer_t printf_task = {1, 0};
task_timer_t heartbeat_task = {100, 0}; // period ms, start ms

task_timer_t uart_logging = { 2, 0};

__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_current[5];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_encoder[8*4];
__attribute__((section(".sram3"), used))
volatile uint16_t adc_dma_buf_pressure[6];

uint32_t timeOfLastPrint=uwTick;


DebouncedButton Button{1,BUTTON_USER_GPIO_PORT,BUTTON_USER_PIN};
DebouncedButton SafetyConnector{1,SAFETY_CONNECTOR_GPIO_Port,SAFETY_CONNECTOR_Pin};
volatile float load_filtered;
uint16_t crc16_calc(const uint8_t *p, size_t n);
bool mount_ok;
bool file_creation_ok;
float time_sec = 0;
int load_cell_counter = 0;

SensorData_t local_sensor_data{'K','D'};

void onImuReport(const BNO085& r);
void onLidarFrame(uint16_t distMm, uint16_t strength);

LowPass load_lpf{1.0f, 1000,1};  // 30 Hz cutoff @ 1 kHz sample rate
LowPass accel_interval{1.0f, 1000,1};  // 30 Hz cutoff @ 1 kHz sample rate
LowPass quatIntRV_interval{1.0f,1000,1};

Profiler free_profiler;
Profiler load_cell_profiler;
Profiler main_loop_profiler;
Profiler printf_profiler;
Profiler adc1_profiler;
Profiler adc2_profiler;
Profiler adc3_profiler;
Profiler tim2_profiler;
Profiler tim3_profiler;
Profiler tim4_profiler;
Profiler button_profiler;
Profiler crc_profiler;
Profiler IMU_profiler;
Profiler sd_card_profiler;
Profiler tim7_profiler;
Profiler kf_profiler;
Profiler tim12_profiler;


//bool True = true;
//MissionControl missionControl(&True,
//			&logData.record);
MissionControl missionControl(&logData.ready, &logData.record);

//platformController platform_controller;



/* Called by MissionControl the moment a mission is triggered, before
 * log_recording goes true. Wire it to your f_expand pre-allocation. */
//static void logPrepareHook(uint32_t estimated_duration_ms, const char *header)
//{
//    const uint32_t bytes_per_s = 1000u * sizeof(SensorData_t);   // ~1 kHz logging
//    const uint32_t bytes = (estimated_duration_ms / 1000u) * bytes_per_s;
////    sd_log_prepare(bytes, header);      // your sd_task API
//
//}
static uint32_t calStartTick = 0;   // set right after beginCalibration()

void app_init() {
	SensorData_Buffer_Init(&logData);

	for (int i = 0; i<4; i++){
		for (int j=0; j<11; j++){
			actuator[i].actuatorController.rtU.ValveFitPressureRatios[j] = ValveFitPressureRatios[i][j];
		}
		actuator[i].actuatorController.rtU.nozzle_gain = nozzle_gain[i];
	}
//	Button.DebouncedButton(1);
	logData.ready=false;
//	logData.record = false;
//	SensorData_Buffer_Init(&logData_axiram);
	HAL_ADCEx_Calibration_Start(&hadc2, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc2, (uint32_t*)adc_dma_buf_current, 5);

	  HAL_ADCEx_Calibration_Start(&hadc1, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc1, (uint32_t*)adc_dma_buf_encoder, 32);

	  HAL_ADCEx_Calibration_Start(&hadc3, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED);
	  HAL_ADC_Start_DMA(&hadc3, (uint32_t*)adc_dma_buf_pressure, 6);


	//  HAL_TIM_Base_Start(&htim3);
	  __HAL_TIM_SET_COUNTER(&htim2, htim2.Instance->ARR - 6);    // ~15 µs to first fire
	  __HAL_TIM_SET_COUNTER(&htim3, htim3.Instance->ARR - 36);   // ~45 µs
//	  actuator[0].actuatorController

#if CHECK_TIMER_FREQUENCIES
	  HAL_TIM_Base_Start_IT(&htim2);  /* pressure */
	  HAL_TIM_Base_Start_IT(&htim3);  /* current */
	  HAL_TIM_Base_Start_IT(&htim4);  /* encoder  */
#else
	  HAL_TIM_Base_Start(&htim2);  /* pressure */
	  HAL_TIM_Base_Start(&htim3);  /* current */
	  HAL_TIM_Base_Start(&htim4);  /* encoder  */
#endif
	  HAL_TIM_Base_Start_IT(&htim5);  /* _IT = interrupt ile */
	  HAL_TIM_Base_Start_IT(&htim12);  /* _IT = interrupt ile */
	  HAL_TIM_Base_Start_IT(&htim7);  /* micros() timebase -- must be running before imu.begin() so its internal sh2 timeouts can actually elapse */

	  HAL_TIM_Base_Start(&htim1);  /* _IT = interrupt ile */

	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3);
	  HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_4);
      BSP_LED_On(LED_RED);

//	  actuator[0].setDuty(1.0f);
//	  motors[0].setDuty(1.0f);
      p.lever[2]   = 0.06f;
      p.sigmaAccel = 0.30f;
      g_altEst.configure(p);
	  if (!imu.begin(&hspi1)) {
//	          Error_Handler();
	      }
//	  imu.enableReport(SH2_RAW_ACCELEROMETER,  2500);
	  imu.enableReport(SH2_GYRO_INTEGRATED_RV, 2500);   // 400 Hz
	  imu.enableReport(SH2_ACCELEROMETER, 5000);   // 200 Hz

//	  imu.enableReport(SH2_GAME_ROTATION_VECTOR,2500);

	  /* nRF24 bring-up check: does the radio answer over SPI4? Standby only,
	   * no CE/RX/TX yet. */
	  {
	      nrf24_cfg_t nrf24_cfg;
	      nrf24_default_cfg(&nrf24_cfg);
	      nrf24_status_t nrf24_st = nrf24_init(&nrf24_cfg);
	      printf("nRF24: %s (status=%d)\r\n",
	             (nrf24_st == NRF24_OK) ? "OK, radio present" : "NOT FOUND",
	             (int)nrf24_st);

	      /* Bench test: broadcast a magic string at the lowest available TX
	       * power. no_ack=true so this needs no listener on the other end -
	       * TX_DS fires as soon as the packet is on air, no ARC retries.
	       * Throwaway test code - remove once past bring-up. */
	      if (nrf24_st == NRF24_OK) {
	          static const char s_magic[] = "KARADELI";
	          uint8_t sent = 0u;

