mkaradeli/Metu-X-stm32/CM7/app/app_main.cpp
	          nrf24_set_power(NRF24_PWR_M18);   /* lowest chip setting - E01's PA still adds ~22 dB */
	          nrf24_start_tx();
	          for (uint8_t i = 0u; i < 20u; i++) {
	              if (nrf24_tx_blocking(s_magic, sizeof(s_magic) - 1u, true, 5000u) == NRF24_OK) {
	                  sent++;
	              }
	              nrf24_port_delay_us(50000u);
	          }
	          printf("nRF24 TX 'KARADELI': %u/20 bursts sent, ch=%u (%u MHz)\r\n",
	                 (unsigned)sent, (unsigned)nrf24_cfg.channel,
	                 (unsigned)(2400u + nrf24_cfg.channel));
	      }
	  }

		lidar.Reset();
//		altEstimator.begin();
		HAL_UARTEx_ReceiveToIdle_DMA(&huart6, lidar.getBuffer(), 128);
//	  dummy_init();
//	  printf(CLR_SCREEN);

//	    local_sensor_data.current_demand = 2;
//	    local_sensor_data.timestamp = 0;
//	    ready_to_write_a=0;

	    main_loop_profiler.reset();
	    printf_profiler.reset();
	    free_profiler.reset();
	    adc1_profiler.reset();
	    adc2_profiler.reset();
	    adc3_profiler.reset();
	    tim2_profiler.reset();
	    tim3_profiler.reset();
	    tim4_profiler.reset();
	    button_profiler.reset();
	    crc_profiler.reset();
	    IMU_profiler.reset();
	    sd_card_profiler.reset();
	    tim7_profiler.reset();
	    tim12_profiler.reset();
	    kf_profiler.reset();



//	    SCB_InvalidateDCache_by_Addr((uint32_t *)adc_dma_buf_encoder, sizeof(adc_dma_buf_encoder));
	    HAL_Delay(10);
	    for (int i=0; i<4; i++)
	    	actuator[i].calibrate();
//	    currentController.initialize();
//	    Actuator::manifold->calibrate();
	    platform_controller.initialize();

//	    if (mount_ok and file_creation_ok)
//			controller_mode = controller_modes::PRESSURE;

		for (int i= 0; i< 4; i++) {
			actuator[i].actuatorController.rtU.pos_feedback = actuator[i].hallEffect.valveAngle;
			actuator[i].actuatorController.rtU.SpeedFeedback = actuator[i].hallEffect.valveVelocity;
			actuator[i].actuatorController.rtU.P_manifold = Actuator::manifold->getPsi();
			actuator[i].actuatorController.rtU.P_nozzle_demand = 0.0F;

		}



//		start_flag = micros();
//		actuator[0].static_manifold = &psSensors[4];

	free_profiler.start();
//	missionControl.Init(taskFunction, shutdownFunction);
//	missionControl.actuator_mode_desired = actuator_mode_desired;
//	missionControl.system_mode_desired = system_modes::TESTFIRE;
//	missionControl.ops_duration_ms = ops_duration_ms;
//	missionControl.shutdown_duration_ms = shutdown_duration_ms;
//	missionControl.postShutdownWait_ms = postShutdownWait_ms;

    missionControl.Init();        // or Init();
    missionControl.Select(defaultMissionIndex);
    mission_uart_init(&huart3);       // whichever UART your ground link is on
    g_altEst.beginCalibration();
    calStartTick = uwTick;
    HAL_GPIO_WritePin(LED1_GPIO_Port, LED1_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, GPIO_PIN_SET);
    HAL_GPIO_WritePin(LED4_GPIO_Port, LED4_Pin, GPIO_PIN_SET);

//	const uint8_t tv[] = "123456789";
//		uint16_t crc = crc16_calc(tv, 9);
//	controller_mode = controller_modes::POSITION;
}
extern "C" {
extern bool pc8_active;

}
bool selfTrigger = false;

bool altitudeEstimatorDone = false;
void app_loop() {

	if (!altitudeEstimatorDone && (uwTick - calStartTick) >= 1500) {
	    if (g_altEst.finishCalibration()) {
	        altitudeEstimatorDone = true;
	    } else {
	        calStartTick = uwTick;      // not enough samples yet, keep collecting
	    }
	}
//	if (task_ready(&button_task)) { // 1ms
//		Button.update();
//
//		if (Button.pressed()) {
//			button_profiler.start();
//			missionControl.Toggle();
//		} else {
//			if (selfTrigger and uwTick==10000) {
//				selfTrigger = false;
//				missionControl.Toggle();
//			}
//		button_profiler.end();
//		}
//	}

		main_loop_profiler.start();

	if (uwTick - timeOfLastPrint >= 1000){

		timeOfLastPrint+= 1000;

		main_loop_profiler.metrics();
		printf_profiler.metrics();
		adc1_profiler.metrics();
		adc2_profiler.metrics();
		adc3_profiler.metrics();
		tim2_profiler.metrics();
		tim3_profiler.metrics();
		tim4_profiler.metrics();
		free_profiler.metrics();
		button_profiler.metrics();
		crc_profiler.metrics();
		IMU_profiler.metrics();
		sd_card_profiler.metrics();
		kf_profiler.metrics();
		tim7_profiler.metrics();
		tim12_profiler.metrics();


	}
		main_loop_profiler.end();
	if (task_ready(&printf_task)) { // 1000 ms
		printf_profiler.start();
		rb_flush();
		printf_profiler.end();
	  }

//	if (task_ready(&IMU_task)) { // 1 ms
//		IMU_profiler.start();
//		imu.service();                 // poll at least every ~1 ms
//		IMU_profiler.end();
//	}
	if (task_ready(&sd_card_task)) { // 500 ms
//		if (HAL_GPIO_ReadPin(SD_CARD_DETECT_GPIO_Port,SD_CARD_DETECT_Pin))
			sd_card_prep();
	}
	sd_card_task_function(); // every iter
}


void tim3_trigger(){
	tim3_profiler.start();
//	timer_counter_tim3+=1; /* Nucleo yeşil LED → PB0 */
	tim3_profiler.end();

}
void tim4_trigger(){
	tim4_profiler.start();
//	timer_counter_tim4 += 1;
	tim4_profiler.end();
}
void tim2_trigger(){
	tim2_profiler.start();
//	timer_counter_tim2 += 1;
	tim2_profiler.end();
}

void tim5_trigger(){
//	tim2_profiler.start();
	micros_overflow++;
//	tim2_profiler.end();
}
int tim7_counter = 0;
void tim7_trigger() { // 1 khz low priority
	tim7_counter++;
	tim7_profiler.start();
	if (true /*task_ready(&button_task)*/) { // 1ms
		Button.update();

		if (Button.pressed()) {
			button_profiler.start();
            missionControl.RequestToggle();     // ISR-safe, serviced in Iter()
            main_loop_profiler.reset();
            	    printf_profiler.reset();
            	    free_profiler.reset();
            	    adc1_profiler.reset();
            	    adc2_profiler.reset();
            	    adc3_profiler.reset();
            	    tim2_profiler.reset();
            	    tim3_profiler.reset();
            	    tim4_profiler.reset();
            	    button_profiler.reset();
            	    crc_profiler.reset();
            	    IMU_profiler.reset();
            	    sd_card_profiler.reset();
            	    tim7_profiler.reset();
            	    tim12_profiler.reset();
            	    kf_profiler.reset();
		} else {
			if (selfTrigger and uwTick==10000) {
				selfTrigger = false;
	            missionControl.RequestToggle();     // ISR-safe, serviced in Iter()
			}
			button_profiler.end();
		}
	}
//	{ // safety connector
//		if (SafetyConnector.pressed()) {
//			missionControl.Toggle();
//		}
//	}
    mission_uart_poll();              // one DMA counter read when idle



//	rb_flush();
	if (task_ready(&IMU_task)) { // 1 ms
		IMU_profiler.start();
		imu.service();                 // poll at least every ~1 ms
		IMU_profiler.end();
	}
	accel_interval.update(imu.accelInterval_us);
	quatIntRV_interval.update(imu.gyroIntegratedRVInterval_us);

    kf_profiler.start();
    {
        // Evaluate both flags separately: && would short-circuit and leave one
        // uncleared. Both are consume-on-read.
        const bool newQuat  = imu.hasNewQuaternion();
        const bool newAccel = imu.hasNewAccel();
        (void)newQuat;
        if (newAccel) {
        	onImuReport(imu);
        }

